# Практика 1.

## В классе

```c
#include <stdio.h>
#define MAXLINE 1000

int main() {
    char line[MAXLINE] = {0};
    getline(line, MAXLINE);
    printf("%s", line);
    return 0;
}


int getline(char s[], int lim) {
    int c, i;

    for(i = 0; i < lim - 1 && (c = getchar()) != EOF && c != '\n'; ++i)
        s[i] = c;
        
    if(c == '\n') {
        s[i] = c;
        ++i;
    }
    
    s[i] = '\0';
    return i;
}
```

### Задание 1

Используя данный код и онлайн компилятор [www.onlinegdb.com/online_c_compiler](https://www.onlinegdb.com/online_c_compiler) необходимо научиться:
- Запускать программу и вводить данные через консоль
- Научиться отлаживать программу
  - Поставить точку останова на строке 6
  - Запустить отладку
  - Перейти из функции main в getline (continue)
  - Построчно исполнить getline (stepover)
  - Проследить изменение локальных переменных и аргумента s. Стек вызовов
  - Возобновить исполнение программы (continue)
  
### Задание 2

Используя библиотечную функцию `atoi` и предложенный выше вариант `getline`, написать программу, считывающую строку с клавиатуры, конвертирующую ее в число и печатающую на консоль с помощью `printf`.
  
### Задание 3

Написать программу, считавывающую с клавиатуры (`getline` + `atoi`) 2 числа a и b. Вывести сумму a + b как код возврата.

### Задание 4

Дан массив из 5 целых чисел. Заполнить массив числами, считанными с клавиатуры. Вывести на консоль среднее арифметическое элементов массива.

### Задание 5
Ввести с клавиатуры N. Вычислить N! используя

- цикл while
- используя рекурсию
  
## Дома

[Читать главу 2 K&R](http://givi.olnd.ru/kr2/02.html). **Подготовиться к тесту к главе 2**

### Задание 1

Напишите программу, которая проверяет является ли число в десятичной записи палиндромом. Проверка на палиндром должна происходить в отдельной функции. Проверка на палиндром должна происходить путем разложения числа на цифры. 

На выходе строка true, если палиндром, иначе - false.
### Задание 2

Напишите программу, принимающую на вход код на языке С, и удаляющую все однострочные (//) и многострочные (/\* \*/) коментарии
  
